In [0]:
# Import des librairies
import pandas as pd 
import numpy as np

In [0]:
# Import des fichiers 
from google.colab import files 
upload = files.upload()

Saving train.csv to train.csv

In [0]:
# Lecture du dataset 
dataset = pd.read_csv("train.csv")
dataset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
dataset.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [0]:
dataset.shape

(891, 12)

In [0]:
# Gestion des valeurs manquantes 
## Méthode Dropna()
dataset.dropna().shape

(183, 12)

In [0]:
# Gestion des valeurs manquantes 
## Méthode fillna
dataset = dataset.fillna(dataset.median())

In [0]:
dataset.Embarked = dataset.Embarked.fillna("HELLO WORLD")
dataset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
# Méthode Interpolation
dataset.interpolate().head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
# Dummyfication
pd.get_dummies(dataset.Embarked, drop_first=True).head()

   HELLO WORLD  Q  S
0            0  0  1
1            0  0  0
2            0  0  1
3            0  0  1
4            0  0  1

# Avoir un super score

In [0]:
dataset.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked       False
dtype: bool

In [0]:
# Virer PassengerId
dataset = dataset.iloc[:, 1:]

In [0]:
# Prendre la longueur de Name & Ticket 
dataset.Name = dataset.Name.apply(lambda x: len(x))
dataset.Ticket = dataset.Ticket.apply(lambda x: len(x))
dataset.head()

   Survived  Pclass  Name     Sex   Age  ...  Parch  Ticket     Fare  Cabin Embarked
0         0       3    23    male  22.0  ...      0       9   7.2500    NaN        S
1         1       1    51  female  38.0  ...      0       8  71.2833    C85        C
2         1       3    22  female  26.0  ...      0      16   7.9250    NaN        S
3         1       1    44  female  35.0  ...      0       6  53.1000   C123        S
4         0       3    24    male  35.0  ...      0       6   8.0500    NaN        S

[5 rows x 11 columns]

In [0]:
dataset.Cabin = dataset.Cabin.apply(lambda x: 1 if x == x else 0)
dataset.head()

   Survived  Pclass  Name     Sex   Age  ...  Parch  Ticket     Fare  Cabin  Embarked
0         0       3    23    male  22.0  ...      0       9   7.2500      0         S
1         1       1    51  female  38.0  ...      0       8  71.2833      1         C
2         1       3    22  female  26.0  ...      0      16   7.9250      0         S
3         1       1    44  female  35.0  ...      0       6  53.1000      1         S
4         0       3    24    male  35.0  ...      0       6   8.0500      0         S

[5 rows x 11 columns]

In [0]:
dataset.Age = pd.cut(dataset.Age,
                      [0, 2, 13, 18, 60, 200],
                    labels=[0, 1, 2, 3, 4])

dataset.head()

   Survived  Pclass  Name     Sex Age  ...  Parch  Ticket     Fare  Cabin  Embarked
0         0       3    23    male   3  ...      0       9   7.2500      0         S
1         1       1    51  female   3  ...      0       8  71.2833      1         C
2         1       3    22  female   3  ...      0      16   7.9250      0         S
3         1       1    44  female   3  ...      0       6  53.1000      1         S
4         0       3    24    male   3  ...      0       6   8.0500      0         S

[5 rows x 11 columns]

In [0]:
dataset.Age = dataset.Age.astype("float64")

In [0]:
dataset["Family_Size"] = dataset["SibSp"] + dataset["Parch"]
dataset.head()

   Survived  Pclass  Name     Sex  ...     Fare  Cabin  Embarked  Family_Size
0         0       3    23    male  ...   7.2500      0         S            1
1         1       1    51  female  ...  71.2833      1         C            1
2         1       3    22  female  ...   7.9250      0         S            0
3         1       1    44  female  ...  53.1000      1         S            1
4         0       3    24    male  ...   8.0500      0         S            0

[5 rows x 12 columns]

In [0]:
dataset.Family_Size = dataset.Family_Size.apply(lambda x: 1 if x > 0 else 0)
dataset.head()

   Survived  Pclass  Name     Sex  ...     Fare  Cabin  Embarked  Family_Size
0         0       3    23    male  ...   7.2500      0         S            1
1         1       1    51  female  ...  71.2833      1         C            1
2         1       3    22  female  ...   7.9250      0         S            0
3         1       1    44  female  ...  53.1000      1         S            1
4         0       3    24    male  ...   8.0500      0         S            0

[5 rows x 12 columns]

In [0]:
dataset = pd.get_dummies(dataset, drop_first=True)
dataset.head()

   Survived  Pclass  Name  ...  Embarked_HELLO WORLD  Embarked_Q  Embarked_S
0         0       3    23  ...                     0           0           1
1         1       1    51  ...                     0           0           0
2         1       3    22  ...                     0           0           1
3         1       1    44  ...                     0           0           1
4         0       3    24  ...                     0           0           1

[5 rows x 14 columns]

In [0]:
X = dataset.iloc[:,1:]
y = dataset.iloc[:, 0]

In [0]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
X = sc_x.fit_transform(X)

In [0]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=0)

In [0]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier.fit(X_train, y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [0]:
classifier.score(X_test, y_test)

0.8071748878923767